'''
Создайте переменные и выполните операции:
  - Создайте переменную num1 и присвойте ей значение 5.
  - Создайте переменную num2 и присвойте ей значение 3.
  - Создайте переменную sum и присвойте ей сумму num1 и num2.
  - Выведите значение переменной sum на экран.
  - Создайте переменную result и присвойте ей результат выражения sum + num1 * num2 .
  - Выведите значение переменной result на экран.
'''

num1 = 5
num2 = 3
sum = num1 + num2
print(sum)      # 8
result = sum + num1*num2
print (result)      # 23